#Курсистите се разделят на отбори по двама. От Лекция
#3 на тема - Структура на една С програма. Побитови
#оператори всеки отбор взема по една задача и създава
#скрипт който да подава входни данни(няколко теста) на
#задачата, програмата извършва изчисленията и връща
#резултат, като скрипта проверява дали резултатът е
#правилен. Подават се разнообразни гранични данни,
#които да съипят програмата. Скрипта проверява за
#връщане на грешки. На всеки тест скрипта след като го
#провери връща съобщение “Теста е премината” ако е
#минал успешно или “Теста не мина, моля поправете
#вашата програма и опитайте пак

#!/bin/bash

#`gcc ./task8.c -o task8`


input="./test_cases.txt"

COUNTER=1

check_output () {

     if [ "$READ" -ne "0" ]
     then
         echo -e "\nTest $COUNTER failed with exit status :  $READ\n"
     else
         echo -e "\nTest $COUNTER is sucsessfull\n"
     fi
 }


while IFS= read -r line
do
    ./task8 $line

    READ=$?

    check_output $COUNTER

    ((COUNTER++))
done < "$input"
