/*Задача 2. Напишете функцията double atof(char *s), която
преобразува стринг в число с десетична запетая. Тази функция е
подобна на разглежданата по-горе atoi(char *s), само че когато се
стигне до . точката, отделяща цялата част от дробната, трябва
да се пусне още един цикъл, който да изчисли числото в
дробната част по същия начин, както е числото в цялата част.
Само че тук при дробната част трябва да имаме една
променлива, която да умножаваме по 10 всеки път до края на
дробната част power *= 10; Накрая трябва да разделим
полученото число на тази променлива, за да получим реалното
число с плаващата заперая на точното място. */

#include <stdio.h>
double atof(char *s);

int main(void){
    char s[] = "123.6";
    printf("%lf", atof(s));

    return 0;
}
double atof(char *s){
    int i;
    double num, power = 0.0;
    
    for(i=0, num=0; s[i] >= '0' && s[i] <= '9'; i++){ 
        num = 10 * num + (s[i] - '0');
    }
    if(s[i]== '.')
        i++;

    for(power=1.0; s[i] >= '0' && s[i] <= '9'; i++){ 
        num = 10.0 * num + (s[i] - '0');
        power *= 10;
    }
    return num/power;
}