/*Задача 11.
Направете обединение с елементи тип int, int, char. Дайте
стойност на елементите един по един -7,10 и “c” и изведете
тези стойности на конзолата.
Инициализирайте и трите и изведете стойностите им на
конзолата.*/

#include <stdio.h>

union myUnion{
    int member1;
    int member2;
    char member3;
}var;

int main(void){

    var.member1 = -7;
    printf("The value of 1st member is: %d\n",var.member1);

    var.member2 = 10;
    printf("The value of 2nd member is: %d\n",var.member2);

    var.member3 = 'c';
    printf("The value of 3th member is: %c\n",var.member3);

    /*Ако се опитаме първо да инициализираме всички членове на обединението наведнъж и след това да отпечатаме
    тяхните стойности, на конзолата ще се отпечата коректно само стойноста на последно инициализирания член, а за останалите
    ще отпечата повредената им стойност. 
    Това е така, тъй като крайната стойност, присвоена на member3, е заела мястото на паметта отделена за обединението*/

    return 0;
}