/*Задача 7. Дефинирайте масив int с 10 елемента. Дефинирайте
пойнтер, който ще сочи към масива. Насочете пойнтера към масива. Нужно
ли е да използвате &? Какво представлява името на масива? Какво сочи?
Колко начина има за да изпишете насочването на пойнтера към масива.
Има ли разлика между тях? */

#include <stdio.h>

int main(void){
    int arr[10] = {1,2,12,4,5,6,7,8,9,10};
    int *pArr;
    pArr= &arr; /*еквиваленто на pArr = arr. И дваата случая насочват поинтера към нулевия*/
    /*Не е необходимо да се използва оператора &, както не е необходимо и да насочваме поинтер към масива,
    тъй като в С името на всеки масив е и указател, който сочи към нулевия му елемент.
    Ако искаме да достъпим даден елемент от масива можем да го направим по няколко начина:
       Пример за достъп до 2ри елемент от даден масив:
        1. arr[2] ;
        2. *(arr+2);
        3. *(pArr+2) */

    printf("%d\n",*(pArr+2));
    printf("%d\n",arr[2]);
    printf("%d\n",*(arr+2));

    return 0;
}