/*4:В какъв ред ще се изпълнят операциите?
true = x&&y&x<<1;
Какво ще се принтира на екрана?
В какъв ред ще се изпълнят операциите?
true = x&&y^x<<1;
Какво ще се принтира на екрана?
*/

#include <stdio.h>

int main(){
    int x = 10;
    int y = 10;
    int true = x&&y&x<<1;
    /*1-во се извършва оператора '<<' тъй като е с най-висок приоритет, след което побитово И
    и накрая логическото И: x&&y&4 -> x&&0  -> 0 */
    printf("%d\n",true);

    true = x&&y^x<<1;
    /*1-во се извършва оператора '<<' тъй като е с най-висок приоритет, след което XOR
    и накрая логическото И: x&&y^4 -> x&&14  -> 1 */

    printf("%d\n",true);
    return 0;
}