/* 5:В какъв ред ще се изпълни операторът запетая ,*/

#include <stdio.h>

int main() {
    int x = 1, y = 0;
    int z = y || x; // 1-во се изпълянва логическото ИЛИ, след което опертора '='
    printf("Z = %d",z);
    printf("\nInit values: X= %d, Y= %d\n", x, y);

    x = 1 + 2, 2 * 3, 3 + 4;
    /*1-во се изпълнява оператора '*' тъи като е с най-висок приоритет, след което оператора '+'
    след него е оператора '=' и накрая оператора ',' тъй като е с най-нисък приоритет:
    x = 1+2,6,3+4 -> x = 3,6,7 -> x=3*/
    y = ( 7 * 8, 8 + 9, 9 - 4);
    /*тук 1-во ще се изпълнят операциите в скобите, след което ще се присвои стойност на у:
    y = (56, 8+9, 9-4) -> y = (56, 17, 5) -> y=5*/
    printf("\nX= %d, Y= %d\n", x, y);

    return 0;
}