/*2. какъв ще бъде резултатът в променливата true:
int x = 10;
int y = 10;
int z = 30;
int true = x==y+(z < y)!=20;*/

#include <stdio.h>

int main(){
    int x = 10;
    int y = 10;
    int z = 30;
    int true = x==y+(z < y)!=20; 
    /*1-во се изпълняват скобите, тъй като са с най-висок приоритет (z<y) -> 0, 
    след което се изпълнява  y+0 -> 10, след него се изпълнява 10 != 20 ->1
    след това се изпълнява x==1 и накрая true = x ->1 тъй като оператора = е с най-нисък приоритет*/

    printf("true = %d",true);

    return 0;
}