/*Първата функция strcpy(s, t), която копира низа t в низа s. Щеше да е
чудесно просто да кажем s = t, но по този начин ще копираме указателите, а
не всички символи от единия в другия масив. За да стане това трябва да
обходим целия масив символ по символ и като използваме цикъл и да
присвоим стойността всеки един елемент от единия масив на същата
позиция в другия.
Задача 6.Опитайте да го направите сами:*/

#include <stdio.h>
void strCpy(char *s, char *t);

int main(void){
    char s[22];
    char t[] = "Hello! This is a test.";

    strCpy(s,t); 
    printf("The new string is: %s",s);

    return 0;
}
void strCpy(char *s, char *t){
    while(*s++ = *t++);
}