/*Задача 3.Какво е грешното на този код?*/

#include <stdio.h>

void my_strcpy(char *t, char *s){
for(; *t; t++, s++)
*s = *t;
}
/*При фор цикълът, сравнението се извършва преди да се присвои елемента,при което
в момента в който достигне терминиращата нула на масива от char цикъла ще прекъсне и няма да я запише.
В този случай, ако в 1вия масив s има вече записана някаква стойност и той е по-голям от t ще се получи конкатенация.*/

int main(void){
    char s[]="Hello Word";  
    char t[]= "Now";

    my_strcpy(t,s); /*Резултата е "Nowlo Word" */
    printf("%s",s);

    return 0;
}