/*9. Дефинирайте променливи със стойност
4.9876543, 7.123456789012345678890, 18 398 458 438 583 853.28, 18 398 458 438
583 853.39875937284928422.
Изведете всяка променлива на екрана със printf()*/

#include <stdio.h>
#include <stdlib.h>

int main(){
    double a = 4.9876543;
    double b = 7.123456789012345678890;
    long double c= 18398458438583853.28;
    long double d = 18398458438583853.39875937284928422;

    printf("A = %.7f\n",a);
    printf("B = %lf\n",b);
    printf("C = %le\n",c);
    printf("D = %le\n",d);
    /* тъй като числата ,след число А, са прекалено големи и са над 64 байта, не могат да бъдат събрани в променлива.
    Като вариант може: да се напише библиотека, ако числото е с 0 след 17/18-тия символ да се изпише с Е-системата, 
    ако целта на програмата е единствено да ги изпринти в конзолата, може да се разпечата като масив от низове.*/

    return 0;
}
